tap "homebrew/bundle"

# Core
brew "age"
brew "chezmoi"
brew "bitwarden-cli"

# Shell / Prompt
brew "starship"
brew "tmux"
brew "zoxide"

# CLI utilities
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "lazygit"
brew "ripgrep"

# Runtime / Version managers
brew "mise"
brew "pyenv"
brew "tfenv"

# Security / Auth
brew "gnupg"
brew "pinentry-mac"
brew "clamav"

# Cloud / Container
brew "kubernetes-cli"

# Cask
cask "1password-cli"
cask "aws-vault-binary"
cask "font-monaspice-nerd-font"
